# """
# @Author: yanzx
# @Date: 2020/10/20 17:25
# @Description: 双指针
# """
#
# from typing import List
#
#
# def threeSum(nums: List[int]) -> List[List[int]]:
#     res = []
#     length = len(nums)
#     if  length < 3:
#         return res
#     # 排序
#     nums.sort()
#
#     for i in range(length-2):
#
#         # 去重
#         if i
#
#         # 前后双指针
#         left, right = i + 1, length - 1
#
#         while left < right:
#
#
#
#
#
#
#     pass
#
#
# if __name__ == '__main__':
#     nums=[12,5,-12,4,-11,11,2,7,2,-5,-14,-3,-3,3,2,-10,9,-15,2,14,-3,-15,-3,-14,-1,-7,11,-4,-11,12,-15,-14,2,10,-2,-1,6,7,13,-15,-13,6,-10,-9,-14,7,-12,3,-1,5,2,11,6,14,12,-10,14,0,-7,11,-10,-7,4,-1,-12,-13,13,1,9,3,1,3,-5,6,9,-4,-2,5,14,12,-5,-6,1,8,-15,-10,5,-15,-2,5,3,3,13,-8,-13,8,-5,8,-6,11,-12,3,0,-2,-6,-14,2,0,6,1,-11,9,2,-3,-6,3,3,-15,-5,-14,5,13,-4,-4,-10,-10,11]
#     res = threeSum(nums)
#     print(res)
